<template>
  <div class="draw-art">
    <h2 style="text-align: center">《造画艺术滤镜隐私政策》</h2>
    <p>杭州探艺科技科技有限公司（以下可统称为“我们”）高度重视个人信息的保护，您在使用我们的服务时，我们可能会收集和使用您的相关信息。对于此协议中加粗的字体部分，请重点阅读并理解。为此我们制定本《用户隐私政策》（也称“本政策”）并就主要内容说明如下：
        <br /><br />1、我们将严格按照《个人信息保护法》及相关法律法规的要求，以合法、正当、必要及诚信为原则处理并保护您的个人信息。
        <br /><br />2、我们将逐一说明我们收集的您的个人信息类型及其对应的用途，以便您了解我们针对某一特定功能所收集的具体个人信息的类别、使用理由及收集方式。
        <br /><br />3、我们仅会在您使用“造画艺术滤镜”特定的场景中向您申请该服务所需的相册权限、相机权限或其他敏感权限，并在获得您的明示同意后基于已授权范围进行使用。
        <br /><br />4、我们会对接入的第三方的软件开发包（SDK）进行严格的安全监测，以保护您的数据安全。详见<b>《附录三、第三方共享信息清单》</b>。
        <br /><br />5、您可以通过本政策第四条途径查阅、更正、删除您的个人信息，也可以撤回同意、注销帐号、投诉举报。
        <br /><br />6、请您在使用“造画艺术滤镜”前仔细阅读并透彻理解本政策，在确认充分理解并同意后再开始使用。如对本政策内容有任何疑问、意见或建议，<b>您可通过电子邮件（tensorart@126.com）与我们联系</b>。
    </p>

      <h2>本政策将帮助您了解以下内容：</h2>
      <p>一、我们如何收集、存储、使用您的个人信息
        <br />二、我们如何传输、共享、公开披露您的个人信息
        <br />三、我们如何保护您的个人信息
        <br />四、您的权利
        <br />五、我们如何处理未成年人的个人信息
        <br />六、本政策的更新
        <br />七、如何联系我们
        <br /><b>附录一、权限申请及应用场景</b>
        <br /><b>附录二、收集个人信息明示清单</b>
        <br /><b>附录三、第三方共享信息清单</b>
      </p>

      <h2>一、我们如何收集、存储、使用您的个人信息</h2>
      <p><b>1.1 注册、登录及使用造画艺术滤镜帐号：</b>为了充分使用本产品和服务的全部功能，您需要在使用造画艺术滤镜平台时注册账号并登录。注册时，您需要提供手机号码进行实名认证，通过手机验证码登录，同时可修改默认的头像和昵称。如果您不提供手机号码，我们将无法为您完成注册登录，也无法为您提供后续的造画艺术滤镜平台服务；
        <br /><br /><b>1.2 用于实名认证：</b>当您使用“造画艺术滤镜”平台的需要进行身份认证的相关功能或服务时（例如用户内容上传、发布、分享等），根据相关法律法规，您需要确保您所使用的第三方账号已完成实名制注册登记，或者您需要提供真实身份信息完成实名认证后才能使用相关功能。这些信息属于敏感个人信息，我们会在征得您的同意后进行收集，并严格保密，不会将其用于本政策以外的其他目的。您也可以选择拒绝提供这些信息，但这将导致您无法使用需要实名认证的特定功能，不过不影响您继续使用造画艺术滤镜的其他功能或服务。为确保信息真实性，我们可能会委托第三方认证机构核验您提供的认证信息。
        <br /><br /><b>1.3 用于图像处理及展示：</b>
        <br />  （1）“造画艺术滤镜”提供了三个核心功能：开始创作、使用模板、社区展示。这些功能的基础是照片编辑、美化、滤镜和修图，同时支持下载、保存至本地和分享至造画模板社区。为了实现这些功能，我们需要获取摄像头和相册权限。这些权限是敏感的，因此我们只会在你同意授权后获取它们。如果你拒绝授权某些必要权限，你将无法使用对应的功能，但不会影响你正常使用“造画艺术滤镜”的其他服务。
        <br />  （2）您理解并同意，在您授权”造画艺术滤镜”访问存储空间/相册权限后，为向您提供优质的服务体验，包括但不限于提升本地相册打开速度及内容预览速度、为您实现作品在“作品集”内实时同步预览、展示等功能（您生成并导出至本地的作品，如果您从本地删除，作品集中也会相应删除。您可以选择将作品发布到模板社区中，如果您从模板社区中删除，本地作品的存储不受影响），我们会在您每次退出并重新打开”造画艺术滤镜”时以合理最小频率访问您的相册以进行仅为前述目的的本地相册预加载。如您不同意，您可不授权我们此项权限，或者，您授权之后也可以随时按照”造画艺术滤镜”端内或手机系统里提供的路径予以撤回授权。
        <br />  （3）我们绝不会私自开启敏感权限窃取你的隐私、读取你的图片内容或收集你日常聊天时的对话，更不会采用此种非法手段进行信息、广告推送。
        <br /><br /><b>1.4 向您提供网络安全及运营安全保障：</b>为了确保您的帐号登录和支付功能正常运行，我们可能会在您使用本产品时收集您的设备信息，包括不可更改的设备标识信息（指由设备制造商编入设备以对其进行标识的一串字符，例如Android的IMEI、AndroidID、OAID、IMSI、ICCID、GAID、MEID、AAID、VAID，本政策中所指的“设备标识信息”均同本定义）、硬件序列号和MAC地址。请您理解，当您将造画艺术滤镜APP切换至后台运行时，由于部分设备机型和系统原因，您此前使用造画艺术滤镜相关功能而产生的信息收集行为可能无法立即停止，从而导致短暂的后台信息收集行为。
        <br /><br /><b>1.5 支付：</b>当您使用造画艺术滤镜支付开通Pro会员服务时，我们会从第三方支付工具处获取您的支付渠道和支付状态，并记录您的支付时间和支付金额。这些信息的收集是为了确认用户是否按约支付费用，以及是否存在收费异常情况，同时用于维护造画艺术滤镜平台的交易秩序和处理用户纠纷。如果您拒绝我们获取您的支付信息，我们将无法为您提供Pro会员服务。
        <br /><br /><b>1.6 向您提供其他相关产品功能和/或服务：</b>为了实现我们的产品功能和/或服务，我们可能需要收集您的个人信息。我们会遵循合法、正当、必要的原则，谨慎收集您的信息。如果您拒绝提供这些信息，可能无法使用相应的服务。在您使用这些功能或服务之前，我们将征求您的单独同意。如果您不同意，您仍然可以使用其他功能或服务，但可能无法使用涉及敏感个人信息的功能或服务。请查看以下具体相关条款。
        <br />  （1）当您使用造画艺术滤镜中的滤镜、相框等工具拍摄并发布内容时，我们会根据您的操作和所选用的工具类型使用传感器信息，以适配您的需求。为了适应您的设备状态，我们会调用您设备的旋转矢量传感器和加速度传感器信息，以识别您的设备横竖屏状态。请注意，我们不会保存该场景下的传感器信息；
        <br />  （2）反馈：如果您使用反馈功能，造画艺术滤镜将记录您提交的文字留言内容。如果您不允许造画艺术滤镜获取您的沟通信息，可能无法使用反馈功能，但不会影响您使用造画艺术滤镜的其他功能；
        <br />  （3）评价：您可以对造画艺术滤镜进行评价，我们不会收集任何评价信息，只会跳转到设备默认的应用市场。如果您不想评价，也不会影响您使用造画艺术滤镜的其他功能；
        <br />  （4）保障帐号安全：当您在使用账号登录、会员状态，且操作行为存在异常需要我们协助排查时，我们可能会要求您提供有效身份信息，以确保上述操作行为的安全性；
        <br />  （5）用于调起第三方支付等功能：当您使用造画艺术滤镜的支付功能时，我们会尝试拉起相应的第三方支付应用，以判断第三方支付应用是否存在，以完成支付功能。这些信息仅用于支付功能，我们不会将其用于其他用途；
        <br />  （6）用于内容分享：当您将造画艺术滤镜中的内容分享至第三方平台时，我们会尝试拉起相应的第三方支付应用，以判断第三方平台是否存在，以达成分享目的。这些信息仅用于分享功能，我们不会将其用于其他用途；
        <br />  （7）手机号码和验证码：当您需要登录以便获取更多功能时，需要在相应页面输入手机号码和动态验证码，手机号码仅用于账户的识别，我们不会向您的手机号码发送任何除验证码以外的信息。动态验证码有一定有效期，过期后需要重新获取；
        <br /><br /><b>1.7 信息存储地域：</b>造画艺术滤镜个人信息存放在境内服务器或其他存储媒介上，不涉及境外服务器存储您的个人信息。
        <br /><br /><b>1.8 用户画像、个性化展示、Cookie 等：</b>造画艺术滤镜不对收集的个人信息进行个性化分析，或用于用户画像、个性化展示等作用。未使用 Cookie 等同类技术(包括脚本、Clickstream、Web 信标、Flash Cookie、内嵌 Web 链接、sdk 等)收集个人信息。
        <br /><br /><b>1.9 第三方共享信息：为了让您更快速地了解我们如何收集您的个人信息，以及第三方对于您个人信息的使用情况，例如信息您可以查看《附录三、第三方共享信息清单》</b>
      </p>

      <h2>二、我们如何传输、共享、公开披露您的个人信息</h2>
      <p>2.1 <b>共享：</b>除以下情形外，未经您同意，我们不会与任何第三方分享您的个人信息：
        <br />  （1）在获取明确同意的情况下共享：只有在获得您的明确同意后，我们才会与其他方共享您的个人信息。
        <br />  （2）在法定条件下共享：我们可能会根据法律法规规定、诉讼争议解决需要或政府主管部门或司法机关依法提出的强制要求，对外共享您的个人信息。
        <br />  （3）在法律允许或要求的情况下，为了保护本产品及其用户或社会公众的利益、财产或安全免遭损害，我们可能需要将您的个人信息共享给第三方。
        <br />  （4）与我们的关联公司共享：我们的产品和服务通常需要与我们的关联公司合作才能完成，因此您的个人信息可能会与他们共享。我们只会共享必要的个人信息，以实现向您提供本产品相关功能和服务的目的，并受本政策所声明的目的限制。如果我们的关联公司需要更改个人信息的处理目的，我们将再次征求您的同意。
        <br /><br /><b>2.2 委托：</b>仅为实现本政策中声明的目的，我们的某些服务将委托由授权的合作伙伴提供。如手机验证码登录、支付、分享等功能。我们会采取必要的技术和组织措施，确保您的个人信息在共享过程中得到保护。如果您不希望我们向合作伙伴共享您的个人信息，您可以选择不使用相关功能/服务。我们将尊重您的选择，并尽力保护您的个人信息安全和隐私
        <br /><br /><b>2.3 信息清单：我们与第三方共享的个人信息的具体种类和目的，您可详见《附录三、第三方共享信息清单》；</b>
        <br /><br /><b>2.4 转让：</b>除非以下情况，否则我们不会将您的个人信息转让给任何公司、组织或个人
        <br />  （1）在明确获得您的同意的前提下，我们会向其他方转让您的个人信息；
        <br />  （2）如果涉及到个人信息转让，例如合并、收购或破产清算，我们将要求新的持有您个人信息的公司、组织等主体继续遵守本政策的约束。如果我们对个人信息的收集、处理方式、使用目的等进行了任何更改，我们将要求该公司、组织等主体重新向您征求授权同意；
        <br /><br /><b>2.5 公开披露：</b>我们仅会在以下情况下，收集或公开披露您的个人信息；
        <br />  （1）获得您的单独同意后；
        <br />  （2）基于法律法规、司法机关或行政主管部门的强制性要求，我们可能会披露您的个人信息；
        <br /><br /><b>2.6 依法不经授权处理个人信息的情形：</b>我们仅会在以下情况下，收集或公开披露您的个人信息；
        <br />  （1）为订立、履行您作为一方当事人的合同所必需；
        <br />  （2）为履行法定职责或者法定义务所必需；
        <br />  （3）为应对突发公共卫生事件，或者紧急情况下为保护您的生命健康和财产安全所必需；
        <br />  （4）为公共利益实施新闻报道、舆论监督等行为，在合理的范围内处理个人信息；
        <br />  （5）依照相关法律规定在合理的范围内处理个人自行公开或者其他已经合法公开的个人信息；
        <br />  （6）法律、行政法规规定的其他情形；
      </p>

      <h2>三、我们如何保护您的个人信息</h2>
      <p>我们仅在本《隐私政策》所述目的所必需的期间和法律法规要求的时限内保留您的个人信息。我们使用各种安全技术和程序，以防信息的丢失、不当使用、未经授权阅览或披露。例如，在某些服务中，我们将利用加密技术（例如SSL）来保护您提供的个人信息。但请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全。您需要了解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的因素而出现问题。
        <br /><br /><b>3.1 保存期限：</b>我们仅会在达成本政策所述目的所需的期限内保留您的个人信息。除非法律法规有强制的留存要求，例如《中华人民共和国电子商务法》要求商品和服务信息、交易信息保存时间自交易完成之日起不少于三年，或者《网络安全法》要求按照规定留存相关的网络日志不少于六个月。我们会根据以下标准来判断个人信息的存储期限，并以其中较长者为准：完成与您相关的服务所需保留的必要期限；应对您可能的查询或投诉；保证我们为您提供服务的安全和质量；您是否同意更长的留存期间；是否存在关于保留期限的其他特别约定或法律法规规定。对于超出期限的个人信息，我们会立即删除或做匿名化处理。
        <br /><br /><b>3.2 互联网并非绝对安全的环境，请使用确保手机动态验证码的安全，协助我们保证您的账号安全。</b>我们将尽力确保或担保您发送给我们的任何信息的安全性。
        <br /><br />3.3 如果发生个人信息安全事件，我们将遵循法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将通过电话、邮件等方式及时告知您，如果难以逐一告知个人信息主体，我们会采取合理、有效的方式发布公告（例如公众号、微博）。同时，我们还将按照监管部门的要求，主动上报个人信息安全事件的处置情况。
        <br /><br />3.4 我们会实时跟进相关法律、法规、标准的更新和合规，我们将会尽最大努力抵御并处置各类信息安全的威胁，为您的信息安全提供全方位保障。
      </p>

      <h2>四、您的权利</h2>
      <p>按照中国相关的法律、法规、标准，我们保障您对自己的个人信息行使以下权利；
        <br /><br /><b>4.1 访问、更正您的个人信息：</b>
        <br />  （1）个人信息访问和更正：您可以通过【造画艺术滤镜】-【我的】-【编辑资料】，来对您帐号中的个人信息、昵称、头像等进行访问和更正；
        <br />  （2）发布内容的删除：您可以于【造画艺术滤镜】-【社区】进入【我的（作品）】，并通过点击作品下拉列表按键调出删除功能；
        <br /><br /><b>4.2 注销账号和删除您的个人信息：</b>
        <br />  （1）<b>注销操作是不可恢复的操作：</b>账号注销后，您将无法再登录相应账号使用相关服务，除我们按照相关法律规定应该保留的相关信息、权益或其他数据外，在您注销账号项下存储、使用等的全部信息、数据等将会被永久删除，请您谨慎进行账号注销操作；此外，账号注销并不代表您在该账号注销前的所有账号行为和相关责任得到豁免或减损。如果您还有尚未使用的权益，注销申请将视为您主动放弃相应权益。
        <br />  （2）<b>我们不在软件中设置账号注销的功能</b>，如您需要注销，在完全理解注销可能产生的后果的前提下，发送邮件到客户服务邮箱tensorart@126.com，主题“账号注销”，并提供账号信息和相关的身份证明资料，我们会在7个工作日内完成注销操作。发送邮件申请账号注销，即视为您完全理解并同意本条目所述内容。
        <br />  （3）删除的个人信息：包括但不限于手机号码、服务端存储的图片和文字信息、帐号登录的历史信息、帐号权益；
        <br /><br /><b>4.3 基本功能模式的使用：</b>基本功能模式提供了造画艺术滤镜的基本功能，包括使用样图图片美化处理、浏览功能。但是，您将无法使用完整的图片处理美化功能，并且无法享受注册/登录、用户图片编辑、模板分享、模板使用等丰富的服务
        <br /><br /><b>4.4 对于您的权利要求的响应：</b>为确保安全，如果您要行使上述权利，可能需要以书面形式提出请求或提供其他身份证明。我们会在验证您的身份后处理您的请求，并在通常情况下的【15】天内做出答复。在以下情形中，按照法律法规要求，我们将无法响应您的请求：
        <br />  （1）与国家安全、国防安全有关的；
        <br />  （2）与公共安全、公共卫生、重大公共利益有关的；
        <br />  （3）与犯罪侦查、起诉、审判和执行判决等有关的；
        <br />  （4）有充分证据表明个人信息主体存在主观恶意或滥用权利的；
        <br />  （5）响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的；
        <br />  （6）涉及商业秘密的；
      </p>

      <h2>五、我们如何处理未成年人的个人信息</h2>
      <p><b>我们极其重视对未成年人个人信息的保护。如果您是未满十八周岁的未成年人，在使用造画艺术滤镜产品或服务时前，您或您的监护⼈需要仔细阅读本政策，并同意依照本政策使⽤造画艺术滤镜产品或服务；</b>
        <br /><br />5.1 如果您是未满14周岁的未成年⼈（以下称“儿童”），在您使用我们的服务前应事先征得您的监护人同意。您和您的监护人需要仔细阅读本政策和《造画艺术滤镜用户协议》，确保在取得监护人对本政策和《造画艺术滤镜用户协议》的同意后，您才可在监护人的指导下使用我们的服务
        <br /><br />5.2 如果您是儿童的监护人，在您指导帮助儿童使用我们的服务前，应仔细阅读并授权同意本政策和《造画艺术滤镜用户协议》，以便我们为您或您监护的儿童提供相应的服务
        <br /><br />5.3 您和/或您的监护人应当理解，当且仅当我们通过您和/或您的监护人提交的信息或者您和/或您的监护人的声明或陈述，判断您为儿童用户时，我们通过您账号收集的个人信息才被视为儿童个人信息。
        <br /><br />5.4 如果您或您的监护人不同意本政策和《造画艺术滤镜用户协议》的任何内容，请您要求您能监护的儿童立即停止访问/使用造画艺术滤镜产品或服务。
      </p>

      <h2>六、本政策的更新</h2>
      <p>6.1 我们将根据实际产品及业务迭代、技术发展与变化和法律法规的最新要求，对本政策做适当的修订，如修订可能影响您的个人信息安全、变更原先的处理目的与处理方式或削减您依据本政策享受的个人信息权利。
        <br /><br />6.2 我们可能适时修订本《隐私政策》的条款，该等修订构成本《隐私政策》的一部分。如该等修订造成您在本《隐私政策》下权利的实质减少，我们将在修订生效前通过在主页上显著位置提示或向您发送电子邮件或以其他方式通知您。在该种情况下，若您继续使用我们的服务，即表示同意受经修订的本《隐私政策》的约束。
      </p>

      <h2>七、如何联系我们</h2>
      <p>如果您对造画艺术滤镜在处理个人信息方面的行为与本政策存在任何疑问、投诉或需要解释说明，您可以以下方式与我们联系。我们将在15天内回复您的请求并尽力解决问题。
        <br />公司名称：杭州探艺科技有限公司
        <br />注册地址：浙江省杭州市萧山区闻堰街道湘山路58号B座701室-1室
        <br />联系方式：电子邮件tensorart@126.com
      </p>

      <h2>附录一、权限申请及应用场景</h2>
      <p>此处仅为权限相关说明，我们将在您使用特定产品功能时，向您申请使用该功能所必须的权限，如您不同意开启该权限，请点击“不允许”，拒绝该权限的申请仅将影响您对特定产品功能的使用。我们在此向您列举产品将可能收集的权限类型及其使用目的。
        <br /><br /><b>网络访问权限：</b>访问网络信息。用于APP与服务器或云存储通信，例如进入模板社区时通过网络获取模板数据、获取用户在使用本软件时产生文件在服务器上的备份、用户反馈的信息。
        <br /><br /><b>存储权限（写入）：</b>写入外部存储。用于将用户拍摄完毕的图片保存到本地等的文件保存功能，帮助用户进行图片美化和下载存储。
        <br /><br /><b>存储权限（读取）：</b>读取外部存储。读取用户本地存储的图片，用于用户添加滤镜、画框等编辑操作。
        <br /><br /><b>相机权限：</b>允许使用相机。产品的拍照功能，获取照片用于用户添加滤镜、画框等编辑操作。
      </p>

      <h2>附录二、收集个人信息明示清单</h2>
      <p>本清单为我们就主要业务场景/功能下，我们可能收集、使用的个人信息的汇总说明。用户使用我们的产品/服务时，我们将依据用户所使用的特定业务场景/功能，依据“合法、正当、必要”的原则，在最小范围内收集用户个人信息。本清单不包括第三方通过造画艺术滤镜App直接/间接收集的用户个人信息，第三方所收集的用户个人信息请通过《附录三、第三方共享信息清单》查看。
        <br /><br /><b>1、登录注册时：</b>
        <br />  使用目的：便于用户完成注册登录
        <br />  收集方式：用户输入
        <br />  个人信息字段：<b>实名制手机号、动态验证码</b>
        <br /><br /><b>2、编辑用户信息时：</b>
        <br />  使用目的：便于用户对个人信息的修改和记录
        <br />  收集方式：用户图片或手动输入
        <br />  个人信息字段：<b>头像图片文件、昵称</b>
        <br /><br /><b>3、发布模板时：</b>
        <br />  使用目的：便于对用户模板进行线上存储，便于用户分享和创建同款
        <br />  收集方式：用户使用发布模板功能APP自动采集
        <br />  个人信息字段：<b>用户编辑产生的图片文件、模板相关的参数信息</b>
        <br /><br /><b>4、反馈或投诉意见时：</b>
        <br />  使用目的：便于用户对应用使用过程中的意见或建议及时反馈给我们
        <br />  收集方式：用户手动输入或选择
        <br />  个人信息字段：<b>用户反馈的文字信息和类型标识</b>
      </p>

      <h2>附录三、第三方共享信息清单</h2>
      <p>为保障造画艺术滤镜App的稳定运行或实现相关功能，我们可能会接入由第三方提供的软件开发包（SDK）、应用程序接口（API）实现前述目的。我们会尽到审慎义务，并与其约定严格的数据保护措施，令其按照相关协议的约定以及适用的数据保护法律的要求来处理个人信息，以保护数据安全。具体请以第三方SDK的官方隐私政策为准。
        <br /><br /><b>1、SDK名称：支付宝支付/阿里设备标识SDK/阿里UTDID</b>
        <br />  服务商：支付宝（中国）网络技术有限公司
        <br />  功能类型：支付
        <br />  共享方式：SDK本机采集和后台接口传输
        <br />  使用目的：实现使用支付宝付款
        <br />  共享的信息：<b>设备标识符 (如IMEI、Android ID、IMSI、ICCID、MEID、IMEI)、SIM卡序列号（运营商名字）、网络信息（网络类型、MAC地址、IP地址、当前连接Wi-Fi信息、获取BSSID、SSID）、定位位置(网络/GPS/基站)权限、指纹识别权限、订单号、订单金额、设备屏幕密度、访问外部存储卡、设备屏幕密度</b>
        <br />  第三方隐私权政策链接：https://render.alipay.com/p/c/k2cx0tg8
        <br />  第三方权限申请及使用说明：https://render.alipay.com/p/c/180020570000000722/index.html
        <br /><br /><b>2、SDK名称：微信支付SDK</b>
        <br />  服务商： 财付通支付科技有限公司
        <br />  功能类型：支付
        <br />  共享方式： SDK本机采集和后台接口传输
        <br />  使用目的： 用户开通及登录使用微信支付服务/反洗钱/风险管理/保障支付安全
        <br />  共享的信息： <b>设备标识符 (如IMEI、Android ID、IMSI、ICCID、MEID、IMEI)、SIM卡序列号、网络信息（MAC地址、IP地址、当前连接Wi-Fi信息）、获取已安装应用列表（访问外部存储卡）、定位位置(网络/GPS/基站，获取精准位置信息、经度信息、纬度信息、GPS状态、位置改变)权限、指纹识别权限、订单号、订单金额</b>
        <br />  使用场景： 实现微信支付
        <br />  第三方隐私权政策链接：https://posts.tenpay.com/posts/18ed0968618e3db204d4931651708953.html
        <br /><br /><b>3、SDK名称：微信SDK</b>
        <br />  服务商： 深圳市腾讯计算机系统有限公司
        <br />  功能类型：微信分享图片或内容
        <br />  共享方式： SDK自行采集
        <br />  使用目的： 支持微信分享
        <br />  共享的信息： <b>设备标识符 (如IMEI、Android ID、IMSI、ICCID、MEID)、MAC地址、IP地址，分享的图片或内容、已安装应用列表、设备屏幕宽度、设备屏幕高度、设备屏幕像素、设备屏幕密度</b>
        <br />  使用场景： 在用户使用微信分享时使用
        <br />  第三方隐私权政策链接：https://support.weixin.qq.com/cgi-bin/mmsupportacctnodeweb-bin/pages/RYiYJkLOrQwu0nb8
        <br /><br /><b>4、SDK名称：腾讯QQ互联SDK</b>
        <br />  服务商： 深圳市腾讯计算机系统有限公司
        <br />  功能类型：QQ分享图片或内容
        <br />  共享方式： SDK自行采集
        <br />  使用目的： 支持QQ分享
        <br />  共享的信息： <b>设备标识符 (如IMEI、Android ID、IMSI、ICCID、MEID)、MAC地址、IP地址、已安装应用列表、设备屏幕密度、分享的图片或内容</b>
        <br />  使用场景： 在用户使用QQ分享时使用
        <br />  第三方隐私权政策链接：https://wiki.connect.qq.com/qq%e4%ba%92%e8%81%94sdk%e9%9a%90%e7%a7%81%e4%bf%9d%e6%8a%a4%e5%a3%b0%e6%98%8e
        <br /><br /><b>5、SDK名称：阿里云OSS/阿里云HttpDNS SDK</b>
        <br />  服务商： 阿里云计算有限公司
        <br />  功能类型：支持图片上传
        <br />  共享方式： SDK自行采集
        <br />  使用目的： 支持模板社区分享
        <br />  共享的信息： <b>访问外部存储卡，访问网络，查看网络状态</b>
        <br />  使用场景： 在用户发布模板时使用
        <br />  第三方隐私权政策链接：http://terms.aliyun.com/legal-agreement/terms/suit_bu1_ali_cloud/suit_bu1_ali_cloud201902141711_54837.html?spm=5176.10695662.7y9jhqsfz.86.17883475PKzAAQ
        <br /><br /><b>其他获取您个人信息的SDK，以及对您个人信息的使用情况：</b>为了能让APP能与本地设备相适配，此部分SDK在使用时需要获取相应的信息。获取的信息仅用于本地设备使用，不对第三方个人或实体进行披露。
        <br /><b>GPUImage（jp.co.cyberagent.android）：</b>获取设备屏幕宽度、设备屏幕高度、访问外部存储卡。便于APP能正确显示资源图片。
        <br /><b>roundedimageview（com.makeramen.roundedimageview）：</b>获取设备屏幕密度。便于APP能正确显示资源图片。
        <br /><b>uCrop（com.yalantis.ucrop）：</b>访问外部存储卡。便于APP能裁剪用户选择的图片，用作APP后续编辑和美化。
      </p>
  </div>
</template>

<script>
export default {
  name: 'RouteDrawArt',
  data: function() {
    return {
      
    }
  },
  methods: {

  },
  computed: {

  },
}
</script>

<style>
.draw-art {
  position: fixed;
  top: 0px;
  left: 0px;
  right: 0px;
  bottom: 0px;
  overflow-y: scroll;
  background: white;
  padding: 10px;
}
</style>